//4. Напишите метод arrayToObject, который превращает массив в объект (использовать рекурсию).

// Створюємо функцію `arrayToObject`, яка приймає масив як вхідний параметр.
function arrayToObject(arr) {
  // Перевіряємо, чи є вхідні дані масивом
  if (!Array.isArray(arr)) {
    throw new TypeError("Параметр arr має бути масивом.");
  }
  // Створюємо порожній об'єкт `obj`, в який будемо зберігати результат.
  const obj = {};

  // Перебираємо кожну пару ключ-значення в масиві `arr` за допомогою циклу `for...of`.
  for (const [key, value] of arr) {
    // Перевіряємо, чи значення є масивом.
    if (Array.isArray(value)) {
      // Якщо значення є масивом, рекурсивно викликаємо функцію `arrayToObject` для обробки вкладеного масиву.
      obj[key] = arrayToObject(value);
    } else {
      // Якщо значення не є масивом, просто додаємо його до об'єкта.
      obj[key] = value;
    }
  }

  // Повертаємо ітоговий об'єкт, який містить дані з масиву.
  return obj;
}

// Задаємо вхідний масив `arr`, який містить дані для перетворення.
const arr = [
  ["name", "Dmitro"],
  ["age", 18],
  [
    "skills",
    [
      ["react", 4],
      ["node.js", 4],
      ["js", 5],
      ["html", 4],
      ["css", 5],
    ],
  ],
];

// Викликаємо функцію `arrayToObject` з вхідним масивом і зберігаємо результат у змінну `result`.
const result = arrayToObject(arr);

// Виводимо результат в консоль для перевірки.
console.log(result);
